# InitialFluxIntensity Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InitialFluxIntensity Constructor
InitialFluxIntensity Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| InitialFluxIntensity(Double) | Creates an initial flux intensity object with the given document and flux values. |
| InitialFluxIntensity(InitialFluxIntensity) | Creates a copy of the given initial flux intensity object |

# See Also
InitialFluxIntensity Class
InitialFluxIntensity Members
Autodesk.Revit.DB.Lighting Namespace